public_html/XOLTResultPickup.xml

Request: 
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0" xmlns:ns2="http://www.ups.com/XMLSchema/XOLTWS/Pickup/v1.1" xmlns:ns3="http://www.ups.com/XMLSchema/XOLTWS/UPSS/v1.0"><SOAP-ENV:Header><ns3:UPSSecurity><ns3:UsernameToken><ns3:Username>E746Y1</ns3:Username><ns3:Password>HASLO100%</ns3:Password></ns3:UsernameToken><ns3:ServiceAccessToken><ns3:AccessLicenseNumber>3CBDFD6E18683396</ns3:AccessLicenseNumber></ns3:ServiceAccessToken></ns3:UPSSecurity></SOAP-ENV:Header><SOAP-ENV:Body><ns2:PickupCreationRequest><ns1:Request><ns1:RequestOption>1</ns1:RequestOption></ns1:Request><ns2:RatePickupIndicator>N</ns2:RatePickupIndicator><ns2:Shipper><ns2:Account><ns2:AccountNumber>E746Y1</ns2:AccountNumber><ns2:AccountCountryCode>PL</ns2:AccountCountryCode></ns2:Account></ns2:Shipper><ns2:PickupDateInfo><ns2:CloseTime>1800</ns2:CloseTime><ns2:ReadyTime>0900</ns2:ReadyTime><ns2:PickupDate>20140327</ns2:PickupDate></ns2:PickupDateInfo><ns2:PickupAddress><ns2:CompanyName>Maciej Pendrak</ns2:CompanyName><ns2:ContactName>Pendrak</ns2:ContactName><ns2:AddressLine>Reja 18 5</ns2:AddressLine><ns2:City>Szczecin</ns2:City><ns2:PostalCode>71561</ns2:PostalCode><ns2:CountryCode>PL</ns2:CountryCode><ns2:ResidentialIndicator>Y</ns2:ResidentialIndicator><ns2:Phone><ns2:Number>503975880</ns2:Number></ns2:Phone></ns2:PickupAddress><ns2:AlternateAddressIndicator>Y</ns2:AlternateAddressIndicator><ns2:PickupPiece><ns2:ServiceCode>011</ns2:ServiceCode><ns2:Quantity>1</ns2:Quantity><ns2:DestinationCountryCode>PL</ns2:DestinationCountryCode><ns2:ContainerCode>01</ns2:ContainerCode></ns2:PickupPiece><ns2:TotalWeight><ns2:Weight>25</ns2:Weight><ns2:UnitOfMeasurement>KGS</ns2:UnitOfMeasurement></ns2:TotalWeight><ns2:OverweightIndicator>N</ns2:OverweightIndicator><ns2:PaymentMethod>01</ns2:PaymentMethod><ns2:SpecialInstruction></ns2:SpecialInstruction><ns2:ReferenceNumber></ns2:ReferenceNumber><ns2:Notification><ns2:ConfirmationEmailAddress>dolcegabbana69@wp.pl</ns2:ConfirmationEmailAddress><ns2:UndeliverableEmailAddress></ns2:UndeliverableEmailAddress></ns2:Notification></ns2:PickupCreationRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>

Response: 
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/><soapenv:Body><pkup:PickupCreationResponse xmlns:pkup="http://www.ups.com/XMLSchema/XOLTWS/Pickup/v1.1"><common:Response xmlns:common="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0"><common:ResponseStatus><common:Code>1</common:Code><common:Description>Success</common:Description></common:ResponseStatus></common:Response><pkup:PRN>2952R26758K</pkup:PRN><pkup:RateStatus><pkup:Code>04</pkup:Code><pkup:Description>Rate not requested</pkup:Description></pkup:RateStatus></pkup:PickupCreationResponse></soapenv:Body></soapenv:Envelope>
